---
kind: type
id: T:Autodesk.Revit.DB.BaseExportOptions
source: html/d88aaa04-8700-ede2-9a8c-c3ac0d71e68b.htm
---
# Autodesk.Revit.DB.BaseExportOptions

The base class for options used to export DWG, DXF and DGN format files.

## Syntax (C#)
```csharp
public class BaseExportOptions : IDisposable
```